rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //A handler method is necessary to enable non-blocking mode. TXRX operations can only be carried 
    //out when non-blocking mode is enabled so a handler is needed here.
    err_code = nrf_drv_twi_init(&m_twi, &twi_lsm9ds1_config, twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}

void non_ble_timer_handler(nrf_timer_event_t event_type, void* p_context)
{
    int32_t ret = 0;
    SEGGER_RTT_WriteString(0, "Timer went off.\n");
    if (current_sensor_mode % 4 == 0)
    {
        //magnetometer at low power and 40 Hz
        ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_LP_1000Hz);

        //blink all 3 leds
        nrf_gpio_pin_toggle(BLE_33_RED_LED);
        nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
        nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
        nrf_delay_ms(25);
        nrf_gpio_pin_toggle(BLE_33_RED_LED);
        nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
        nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
    }
    else if (current_sensor_mode % 4 == 1)
    {
        //magnetometer at medium power and 40 Hz
        ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_MP_560Hz);

        //blink the red LED
        nrf_gpio_pin_toggle(BLE_33_RED_LED);
        nrf_delay_ms(25);
        nrf_gpio_pin_toggle(BLE_33_RED_LED);
    }
    else if (current_sensor_mode % 4 == 2)
    {
        //magnetometer at high power and 40 Hz
        ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_HP_300Hz);

        //blink the green LED
        nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
        nrf_delay_ms(25);
        nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
    }
    else if (current_sensor_mode % 4 == 3)
    {
        //magnetometer at ultra high power and 40 Hz
        ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_UHP_155Hz);

        //blink the blue LED
        nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
        nrf_delay_ms(25);
        nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
    }
    current_sensor_mode++;
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    twi_init();
    lsm9ds1_init();
    NRF_LOG_FLUSH(); //flush out all logs called during initialization

    // Start execution.
    NRF_LOG_INFO("Personal Caddie Initialized");
    NRF_LOG_PROCESS();
    application_timers_start();

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle(); //puts CPU into sleep and waits for an even signal to wake it up
    }
}

static int32_t read_imu(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len)
{
    //The steps for a single byte read are as follows:
    //  1. nRF52840 sends start signal by pulling the SDA line low
    //  2. nRF52840 sends 7-bit slave address followed by a 0 (write) bit
    //  3. LSM9DS1 responds with an Acknowledge
    //  4. nRF52840 sends the 8-bit address of the register it wants to read
    //  5. LSM9DS1 responds with an Acknowledge
    //  6. nRF52840 sends a repeated start signal
    //  7. nRG52840 sends 7-bit slave address followed by a 1 (read) bit
    //  8. LSM9DS1 responds with an Acknowledge
    //  9. LSM9DS1 sends the requested data
    // 10. nRF52840 responds with a non-Acknowledge and then sends the stop signal
    //Since reading the LSM9DS1 requires a repeated start signal the NRF_DRV_TWI_XFER_TXRX transfer type is used
    ret_code_t err_code = 0;

    //the primary buffer only holds the address of the register we want to read and therefore only has a length of 1 byte
    //the secondary buffer is where the data will get read into
    const nrf_drv_twi_xfer_desc_t lsm9ds1_imu_read = {
        .address = (LSM9DS1_IMU_I2C_ADD_H >> 1),
        .primary_length = 1,
        .secondary_length = (uint8_t)len,
        .p_primary_buf = &reg,
        .p_secondary_buf = bufp,
        .type =  NRF_DRV_TWI_XFER_TXRX};

    m_xfer_done = false; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)

    do
    {
        err_code = nrf_drv_twi_xfer(&m_twi, &lsm9ds1_imu_read, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}
static int32_t write_imu(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len)
{
    ret_code_t err_code = 0;

    uint8_t register_and_data[2] = {reg, bufp[0]};

    //the primary buffer will hold the register address, as well as the value to write into it.
    //for a single write operation, the secondary buffer has no use in a single write command
    const nrf_drv_twi_xfer_desc_t lsm9ds1_imu_write = {
        .address = (LSM9DS1_IMU_I2C_ADD_H >> 1),
        .primary_length = 2,
        .secondary_length = 0,
        .p_primary_buf = register_and_data,
        .p_secondary_buf = NULL,
        .type =  NRF_DRV_TWI_XFER_TX};

    m_xfer_done = false; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)

    do
    {
        err_code = nrf_drv_twi_xfer(&m_twi, &lsm9ds1_imu_write, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}
static int32_t read_mag(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len)
{
    ret_code_t err_code = 0;

